sabre_docs/GetPassengerDataRQ_v4-0-4_Samples/GetPassengerDataRQ_v4-0-3_SamplePayload_4_2_7.xml

<SamplePayloads>
<!--Request-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:mes="http://www.ebxml.org/namespaces/messageHeader" xmlns:v4="http://services.sabre.com/checkin/getPassengerData/v4">
   <soapenv:Header>
  <eb:MessageHeader eb:id="" eb:version="1.0" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader">
   <eb:From>
    <eb:PartyId eb:type="URI">Client</eb:PartyId>
   </eb:From>
   <eb:To>
    <eb:PartyId eb:type="URI">Server</eb:PartyId>
   </eb:To>
   <eb:CPAId>IPCC</eb:CPAId>
   <eb:ConversationId>9DB7_921682_1204548352874</eb:ConversationId>
   <eb:Service>GetPassengerDataRQ</eb:Service>
   <eb:Action>GetPassengerDataRQ</eb:Action>
   <eb:MessageData>
    <eb:MessageId>mid:1</eb:MessageId>
    <eb:Timestamp>2008-03-03T12:45:52</eb:Timestamp>
   </eb:MessageData>
  </eb:MessageHeader>
  <wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext">
   <wsse:BinarySecurityToken EncodingType="wsse:Base64Binary" valueType="String">${#TestCase#BST}</wsse:BinarySecurityToken>
  </wsse:Security>
 </soapenv:Header>
   <soapenv:Body>
      <v4:GetPassengerDataRQ validateCheckInRequirements="true" includeTimaticInfo="false"  version="4.0.3">
          <BagTagNumber>0061464375</BagTagNumber>
		  <Client>WEB</Client>
      </v4:GetPassengerDataRQ>
   </soapenv:Body>        
</soapenv:Envelope>


<!--Response-->
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
   <soap-env:Header>
      <eb:MessageHeader eb:version="1.0" soap-env:mustUnderstand="1" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader">
         <eb:From>
            <eb:PartyId eb:type="URI">Server</eb:PartyId>
         </eb:From>
         <eb:To>
            <eb:PartyId eb:type="URI">Client</eb:PartyId>
         </eb:To>
         <eb:CPAId>IPCC</eb:CPAId>
         <eb:ConversationId>9DB7_921682_1204548352874</eb:ConversationId>
         <eb:Service>GetPassengerDataRQ</eb:Service>
         <eb:Action>GetPassengerDataRS</eb:Action>
         <eb:MessageData>
            <eb:MessageId>329403744668100610</eb:MessageId>
            <eb:Timestamp>2018-05-04T20:41:07</eb:Timestamp>
            <eb:RefToMessageId>mid:1</eb:RefToMessageId>
         </eb:MessageData>
      </eb:MessageHeader>
      <wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext">
         <wsse:BinarySecurityToken valueType="String" EncodingType="wsse:Base64Binary">Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/STSB!ICESMSLB\/STS.LB!-3150421836585062006!207377!0</wsse:BinarySecurityToken>
      </wsse:Security>
   </soap-env:Header>
   <soap-env:Body>
      <ns3:GetPassengerDataRS xmlns:ns3="http://services.sabre.com/checkin/getPassengerData/v4" xmlns:ns2="http://services.sabre.com/STL/v3">
         <PassengerDataResponseList>
            <PassengerDataResponse>
               <LineNumber>1</LineNumber>
               <LastName>TEST</LastName>
               <FirstName>PAX</FirstName>
               <PassengerID>DB15B93A0101</PassengerID>
               <PNRLocator nameAssociationID="1">VWLGVM</PNRLocator>
               <GroupCode>AD2</GroupCode>
               <BaggageRouteList>
                  <ns2:BaggageRoute>
                     <ns2:SegmentID>1</ns2:SegmentID>
                     <ns2:Airline>EY</ns2:Airline>
                     <ns2:Flight>1</ns2:Flight>
                     <ns2:BookingClass>Y</ns2:BookingClass>
                     <ns2:OperatingAirline>EY</ns2:OperatingAirline>
                     <ns2:OperatingFlight>1</ns2:OperatingFlight>
                     <ns2:Origin>AUH</ns2:Origin>
                     <ns2:Destination>FRA</ns2:Destination>
                     <ns2:DepartureDate>2018-05-05</ns2:DepartureDate>
                     <ns2:DepartureTime>02:00AM</ns2:DepartureTime>
                     <ns2:ArrivalDate>2018-05-05</ns2:ArrivalDate>
                     <ns2:ArrivalTime>06:40AM</ns2:ArrivalTime>
                     <ns2:SegmentStatus>HK</ns2:SegmentStatus>
                     <ns2:PassengerID>DB15B93A0101</ns2:PassengerID>
                  </ns2:BaggageRoute>
               </BaggageRouteList>
               <PassengerItineraryList>
                  <PassengerItinerary>
                     <SegmentID>2</SegmentID>
                     <Priority>EOS</Priority>
                     <Airline>EY</Airline>
                     <Flight>1</Flight>
                     <OperatingAirline>EY</OperatingAirline>
                     <OperatingFlight>1</OperatingFlight>
                     <MarketingAirline>EY</MarketingAirline>
                     <MarketingFlight>1</MarketingFlight>
                     <ThirdPartyGroundHandled>false</ThirdPartyGroundHandled>
                     <BookingClass>Y</BookingClass>
                     <Origin>AUH</Origin>
                     <Destination>FRA</Destination>
                     <DepartureDate>2018-05-05</DepartureDate>
                     <AircraftType>789</AircraftType>
                     <Cabin>Y</Cabin>
                     <Seat>17D</Seat>
                     <PassengerType>F</PassengerType>
                     <BagCount>1</BagCount>
                     <TotalBagWeightAndUnit>10</TotalBagWeightAndUnit>
                     <EditCodeList>
                        <ns2:EditCode>M</ns2:EditCode>
                        <ns2:EditCode>IB</ns2:EditCode>
                        <ns2:EditCode>EIB</ns2:EditCode>
                        <ns2:EditCode>ES</ns2:EditCode>
                        <ns2:EditCode>PRCH</ns2:EditCode>
                        <ns2:EditCode>DOCS</ns2:EditCode>
                        <ns2:EditCode>AE</ns2:EditCode>
                        <ns2:EditCode>APP</ns2:EditCode>
                        <ns2:EditCode>AUTO</ns2:EditCode>
                     </EditCodeList>
                     <CheckInNumber>1</CheckInNumber>
                     <BagTagInfoList>
                        <BagTagInfo>
                           <ns2:BagTagNumber>0061464375</ns2:BagTagNumber>
                           <ns2:Airline>HM</ns2:Airline>
                           <ns2:BagOrigin>AUH</ns2:BagOrigin>
                           <ns2:BagFinalDestination>FRA</ns2:BagFinalDestination>
                        </BagTagInfo>
                     </BagTagInfoList>
                     <AEDetailsList>
                        <ns2:AEDetails>
                           <ns2:ItemID>F</ns2:ItemID>
                           <ns2:ATPCOGroupCode>SA</ns2:ATPCOGroupCode>
                           <ns2:ATPCOSubCode>0B5</ns2:ATPCOSubCode>
                           <ns2:StatusCode>HK</ns2:StatusCode>
                           <ns2:UsedEMD>true</ns2:UsedEMD>
                           <ns2:QuantityUsed>0</ns2:QuantityUsed>
                           <ns2:QuantityBought>1</ns2:QuantityBought>
                           <ns2:PurchaseDate>2018-05-02</ns2:PurchaseDate>
                           <ns2:PurchaseTime>12:00AM</ns2:PurchaseTime>
                           <ns2:Disassociated>false</ns2:Disassociated>
                           <ns2:MarketingAirline>EY</ns2:MarketingAirline>
                           <ns2:MarketingFlight>0001</ns2:MarketingFlight>
                           <ns2:Origin>AUH</ns2:Origin>
                           <ns2:Destination>FRA</ns2:Destination>
                           <ns2:OperatingAirline>EY</ns2:OperatingAirline>
                           <ns2:OperatingFlight>0001</ns2:OperatingFlight>
                           <ns2:PriceDetails>
                              <ns2:TotalPrice currencyCode="USD">0</ns2:TotalPrice>
                              <ns2:BasePrice currencyCode="USD">0</ns2:BasePrice>
                              <ns2:EquivalentPrice>0</ns2:EquivalentPrice>
                           </ns2:PriceDetails>
                        </ns2:AEDetails>
                     </AEDetailsList>
                     <RequiredInfoList>
                        <RequiredInfo>
                           <Code>DOCV</Code>
                           <DetailStatus>ValidationRequired</DetailStatus>
                           <FreeText>!VERIFY TRAVEL DOCUMENT DATA, THEN ADD DOCV</FreeText>
                        </RequiredInfo>
                        <RequiredInfo>
                           <Code>DOCA/R</Code>
                           <DetailStatus>ValidationRequired</DetailStatus>
                           <FreeText>!ENTER DOCA RESIDENCE INFO</FreeText>
                        </RequiredInfo>
                        <RequiredInfo>
                           <Code>TIM</Code>
                           <DetailStatus>ValidationRequired</DetailStatus>
                           <FreeText>TIM-TIMATIC STATUS REQUIRED</FreeText>
                        </RequiredInfo>
                     </RequiredInfoList>
                  </PassengerItinerary>
               </PassengerItineraryList>
               <RequiredInfoSumList>
                  <RequiredInfo>
                     <Code>DOCV</Code>
                     <DetailStatus>ValidationRequired</DetailStatus>
                     <FreeText>!VERIFY TRAVEL DOCUMENT DATA, THEN ADD DOCV</FreeText>
                  </RequiredInfo>
                  <RequiredInfo>
                     <Code>DOCA/R</Code>
                     <DetailStatus>ValidationRequired</DetailStatus>
                     <FreeText>!ENTER DOCA RESIDENCE INFO</FreeText>
                  </RequiredInfo>
                  <RequiredInfo>
                     <Code>TIM</Code>
                     <DetailStatus>ValidationRequired</DetailStatus>
                     <FreeText>TIM-TIMATIC STATUS REQUIRED</FreeText>
                  </RequiredInfo>
               </RequiredInfoSumList>
               <FreeTextInfoList>
                  <ns2:FreeTextInfo>
                     <ns2:EditCode>AE</ns2:EditCode>
                     <ns2:TextLine>
                        <ns2:Text>EY 0001/AUHFRA/     SA /HK/1 /0</ns2:Text>
                     </ns2:TextLine>
                  </ns2:FreeTextInfo>
                  <ns2:FreeTextInfo>
                     <ns2:EditCode>BT</ns2:EditCode>
                     <ns2:TextLine>
                        <ns2:Text>HM FRA    0061464375</ns2:Text>
                     </ns2:TextLine>
                  </ns2:FreeTextInfo>
                  <ns2:FreeTextInfo>
                     <ns2:EditCode>BT</ns2:EditCode>
                     <ns2:TextLine>
                        <ns2:Text>1 / 10 KG</ns2:Text>
                     </ns2:TextLine>
                  </ns2:FreeTextInfo>
                  <ns2:FreeTextInfo>
                     <ns2:EditCode>DOCS</ns2:EditCode>
                     <ns2:TextLine>
                        <ns2:Text>P/US/428498662/US/04MAR45/M/09AUG18/TEST/PAX</ns2:Text>
                     </ns2:TextLine>
                  </ns2:FreeTextInfo>
                  <ns2:FreeTextInfo>
                     <ns2:EditCode>PCTC</ns2:EditCode>
                     <ns2:TextLine>
                        <ns2:Text>DECLINED</ns2:Text>
                     </ns2:TextLine>
                  </ns2:FreeTextInfo>
                  <ns2:FreeTextInfo>
                     <ns2:EditCode>APP</ns2:EditCode>
                     <ns2:TextLine>
                        <ns2:Text>AE/8503/B-N/BOARD IF DOCS OK</ns2:Text>
                     </ns2:TextLine>
                  </ns2:FreeTextInfo>
                  <ns2:FreeTextInfo>
                     <ns2:TextLine>
                        <ns2:Text>*** PSGR THROUGH-CHECKED FROM HM 18 ***</ns2:Text>
                     </ns2:TextLine>
                  </ns2:FreeTextInfo>
               </FreeTextInfoList>
            </PassengerDataResponse>
         </PassengerDataResponseList>
         <Result messageId="ID-acs-int2-sgdcelab-sabre-com-1525454802922-2-1934" timeStamp="2018-05-04T20:41:07.363Z">
            <ns2:Status>Success</ns2:Status>
            <ns2:CompletionStatus>Complete</ns2:CompletionStatus>
            <ns2:System>ACS-BSO</ns2:System>
         </Result>
      </ns3:GetPassengerDataRS>
   </soap-env:Body>
</soap-env:Envelope>